[
    {
        "slug": "learn-next",
        "title": "Mastering NextJS",
        "author": "Lee Robinson",
        "type": "Free",
        "startdate": "Soon",
        "duration": "3 weeks",
        "text": "A free video course for building static and server-side rendered applications with Next.js and React.",
        "url": "https://masteringnextjs.com/"
    },
    {
        "slug": "tailwind-masterclass",
        "title": "Design with Tailwind CSS Masterclass",
        "author": "Adam Wathan",
        "type": "Free",
        "startdate": "Soon",
        "duration": "2 weeks",
        "text": "Design with Tailwind CSS is a series that teaches you how to build fully responsive, professionally designed UIs from scratch using Tailwind CSS.",
        "url": "https://egghead.io/courses/design-with-tailwind-css-masterclass-f0db"
    },
    {
        "slug": "netflix-clone",
        "title": "Netflix Clone - React Tutorial - Styled Components - Firebase",
        "author": " Karl Hadwen",
        "type": "Free",
        "startdate": "Soon",
        "duration": "2 weeks",
        "text": "In this React Tutorial, we will build a Netflix clone! This React project has multiple pages: Home, Browse (which uses Firebase authentication), sign in, and sign up. The sign in will connect to Firebase when a user tries to sign in, and when a user signs up, we will use Firebase auth to store the user in the Firebase auth database.",
        "url": "https://www.youtube.com/watch?v=x_EEwGe-a9o&list=LL&index=32"
    },
    {
        "slug": "instagram-clone",
        "title": "Instagram Clone - React Tutorial - Tailwind CSS - Firebase - React Testing Library",
        "author": " Karl Hadwen",
        "type": "Free",
        "startdate": "Soon",
        "duration": "2 weeks",
        "text": "In this React Tutorial, we will build an Instagram clone! This React project has multiple pages: login, sign up, dashboard (to view/like/comment on photos), and user profiles. The sign-in page will connect to Firebase when a user tries to sign in, and when a user signs up, we will use Firebase auth to store the user in the Firebase auth database.",
        "url": "https://www.youtube.com/watch?v=AKeaaa8yAAk"
    }
]